boring-airlines-server/app/controllers/flights_controller.rb

  def show
    @flight = Flight.find_by params[:id]
---
SELECT  "flights".* FROM "flights" WHERE (1) LIMIT ?  [["LIMIT", 1]]

    def set_flight
      @flight = Flight.find(params[:id])
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]