boring-airlines-server/app/controllers/planes_controller.rb

  def index
    @planes = Plane.all
---
SELECT "planes".* FROM "planes"

  def create
    @plane = Plane.new(plane_params)

    respond_to do |format|
      if @plane.save
---
INSERT INTO "planes" ("row", "column", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["row", 4444], ["column", 5555], ["name", "33333"], ["created_at", "2020-11-04 06:31:32.514278"], ["updated_at", "2020-11-04 06:31:32.514278"]]

    def set_plane
      @plane = Plane.find(params[:id])
---
SELECT  "planes".* FROM "planes" WHERE "planes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]