boring-airlines-server/app/controllers/users_controller.rb

    def create
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)